[
  {
    "id": 1,
    "name": "Список Шиндлера",
    "year": 1993,
    "description": "Фильм рассказывает реальную историю загадочного Оскара Шиндлера, члена нацистской партии, преуспевающего фабриканта, спасшего во время Второй мировой войны почти 1200 евреев.",
    "genre": [
      1,
      2,
      3
    ]
  },
  {
    "id": 2,
    "name": "Властелин колец: Две крепости",
    "year": 2002,
    "description": "Братство распалось, но Кольцо Всевластья должно быть уничтожено. Фродо и Сэм вынуждены довериться Голлуму, который взялся провести их к вратам Мордора. Громадная армия Сарумана приближается: члены братства и их союзники готовы принять бой. Битва за Средиземье продолжается.",
    "genre": [
      4,
      5,
      1,
      6
    ]
  },
  {
    "id": 3,
    "name": "ВАЛЛ·И",
    "year": 2008,
    "description": "Робот ВАЛЛ·И из года в год прилежно трудится на опустевшей Земле, очищая нашу планету от гор мусора, которые оставили после себя улетевшие в космос люди. Он и не представляет, что совсем скоро произойдут невероятные события, благодаря которым он встретит друзей, поднимется к звездам и даже сумеет изменить к лучшему своих бывших хозяев, совсем позабывших родную Землю.",
    "genre": [
      7
    ]
  },
  {
    "id": 4,
    "name": "Гладиатор",
    "year": 2000,
    "description": "В великой Римской империи не было военачальника, равного генералу Максимусу. Непобедимые легионы, которыми командовал этот благородный воин, боготворили его и могли последовать за ним даже в ад. Но случилось так, что отважный Максимус, готовый сразиться с любым противником в честном бою, оказался бессилен против вероломных придворных интриг. Генерала предали и приговорили к смерти. Чудом избежав гибели, Максимус становится гладиатором.",
    "genre": [
      3,
      6,
      1,
      5
    ]
  },
  {
    "id": 5,
    "name": "Остров сокровищ",
    "year": 1988,
    "description": "Шхуна «Испаньола» бороздит морские просторы в поисках острова, на котором спрятаны легендарные сокровища пиратского капитана Флинта. На корабле зреет заговор. Разбойники во главе с одноногим Джоном Сильвером, кажется, близки к цели.",
    "genre": [
      7
    ]
  },
  {
    "id": 6,
    "name": "По соображениям совести",
    "year": 2016,
    "description": "Медик американской армии времён Второй мировой войны Десмонд Досс, который служил во время битвы за Окинаву, отказывается убивать людей и становится первым идейным уклонистом в американской истории, удостоенным Медали Почёта.",
    "genre": [
      2,
      1,
      3
    ]
  },
  {
    "id": 7,
    "name": "Остров проклятых",
    "year": 2009,
    "description": "Два американских судебных пристава отправляются на один из островов в штате Массачусетс, чтобы расследовать исчезновение пациентки клиники для умалишенных преступников. При проведении расследования им придется столкнуться с паутиной лжи, обрушившимся ураганом и смертельным бунтом обитателей клиники.",
    "genre": [
      9,
      10,
      1
    ]
  },
  {
    "id": 8,
    "name": "Гарри Поттер и Дары Смерти: Часть II",
    "year": 2011,
    "description": "В грандиозной последней главе битва между добрыми и злыми силами мира волшебников перерастает во всеобщую войну. Ставки ещё никогда не были так высоки, а поиск убежища — столь сложен. И, быть может, именно Гарри Поттеру придется пожертвовать всем в финальном сражении с Волан-де-Мортом.",
    "genre": [
      4,
      10,
      5
    ]
  },
  {
    "id": 9,
    "name": "Бриллиантовая рука",
    "year": 1968,
    "description": "В южном городке орудует шайка валютчиков, возглавляемая Шефом и его помощником Графом (в быту — Геной Козодоевым). Скромный советский служащий и примерный семьянин Семен Семенович Горбунков отправляется в зарубежный круиз на теплоходе, где также плывет Граф, который должен забрать бриллианты в одном из восточных городов и провезти их в загипсованной руке. Но из-за недоразумения вместо жулика на условленном месте падает ничего не подозревающий Семен Семенович, и драгоценный гипс накладывают ему.",
    "genre": [
      8
    ]
  },
  {
    "id": 10,
    "name": "Назад в будущее 2",
    "year": 1989,
    "description": "Продолжение фантастической истории о приключениях американского подростка во времени. На этот раз с помощью модернизированной Доком машины времени Марти из 80-х попадает в будущее.",
    "genre": [
      11,
      5,
      6,
      8
    ]
  },
  {
    "id": 11,
    "name": "Рататуй",
    "year": 2007,
    "description": "Крыс Реми обладает уникальным вкусом. Он готов рисковать собственной жизнью, чтобы посмотреть любимое кулинарное шоу и раздобыть какую-нибудь приправку или просто свежий продукт. Реми живет со своими сородичами, которые его не понимают и не принимают его увлечения кулинарией. Когда Реми случайно попадает на кухню шикарного ресторана, он решает воспользоваться выпавшим ему шансом и проверить свои навыки.",
    "genre": [
      7
    ]
  },
  {
    "id": 12,
    "name": "Шрэк 2",
    "year": 2004,
    "description": "Шрэк и Фиона возвращаются после медового месяца и находят письмо от родителей Фионы с приглашением на ужин. Однако те не подозревают, что их дочь тоже стала огром! Вместе с Осликом счастливая пара отправляется в путешествие, полное неожиданностей, и попадает в круговорот событий, во время которых приобретает множество друзей…",
    "genre": [
      7,
      4,
      8,
      5
    ]
  },
  {
    "id": 13,
    "name": "Корпорация монстров",
    "year": 2001,
    "description": "Полнометражный мультфильм рассказывает о кризисах в мире монстров, их жизни. Но однажды вся мирная жизнь монстров оказывается под угрозой: в их мир попадает ребенок. А с детьми столько хлопот, что они могут довести даже монстров.",
    "genre": [
      7,
      8,
      4
    ]
  },
  {
    "id": 14,
    "name": "Звёздные войны: Эпизод 3 — Месть ситхов",
    "year": 2005,
    "description": "Идёт третий год Войн клонов. Галактическая Республика, некогда бывшая спокойным и гармоничным государством, превратилась в поле битвы между армиями клонов, возглавляемых канцлером Палпатином, и армадами дроидов, которых ведёт граф Дуку, тёмный лорд ситхов. Республика медленно погружается во тьму. Лишь рыцари-джедаи, защитники мира и справедливости, могут противостоять злу, которое вскоре поглотит галактику. Но настоящая битва идёт в душе у молодого рыцаря-джедая Энакина, который разрывается между долгом джедая и любовью к своей жене, сенатору Падме Амидале. И от того, какое чувство в нём победит, зависит будущее всего мира.",
    "genre": [
      11,
      6,
      4,
      5
    ]
  },
  {
    "id": 15,
    "name": "Укрощение строптивого",
    "year": 1980,
    "description": "Категорически не приемлющий женского общества грубоватый фермер вполне счастлив и доволен своей холостяцкой жизнью. Но неожиданно появившаяся в его жизни женщина пытается изменить его взгляды на жизнь и очаровать его.",
    "genre": [
      8
    ]
  },
  {
    "id": 16,
    "name": "Аладдин",
    "year": 1992,
    "description": "В славном граде Аграба живёт Аладдин, веселый воришка с золотым сердцем. Живёт и не знает, что вскоре его ждёт величайшее приключение в жизни. Ведь только с его помощью чёрный маг Джафар может овладеть невероятным сокровищем — лампой, в которой заключён исполняющий желания могущественный Джинн. И только хитроумие, смекалка и доброта Аладдина и его друзей — обезьянки Абу, принцессы Жасмин и самого Джинна - способны помешать Джафару завладеть лампой и захватить власть над миром.",
    "genre": [
      7,
      4,
      8,
      5
    ]
  },
  {
    "id": 17,
    "name": "Матрица",
    "year": 1999,
    "description": "Жизнь Томаса Андерсона разделена на две части: днём он — самый обычный офисный работник, получающий нагоняи от начальства, а ночью превращается в хакера по имени Нео, и нет места в сети, куда он бы не смог проникнуть. Но однажды всё меняется. Томас узнаёт ужасающую правду о реальности.",
    "genre": [
      11,
      6
    ]
  },
  {
    "id": 18,
    "name": "Престиж",
    "year": 2006,
    "description": "Роберт и Альфред - фокусники-иллюзионисты, которые на рубеже XIX и XX веков соперничали друг с другом в Лондоне. С годами их дружеская конкуренция на профессиональной почве перерастает в настоящую войну.",
    "genre": [
      9,
      11,
      1,
      10
    ]
  },
  {
    "id": 19,
    "name": "Мстители: Война бесконечности",
    "year": 2018,
    "description": "Пока Мстители и их союзники продолжают защищать мир от различных опасностей, с которыми не смог бы справиться один супергерой, новая угроза возникает из космоса: Танос. Межгалактический тиран преследует цель собрать все шесть Камней Бесконечности - артефакты невероятной силы, с помощью которых можно менять реальность по своему желанию. Всё, с чем Мстители сталкивались ранее, вело к этому моменту – судьба Земли никогда ещё не была столь неопределённой.",
    "genre": [
      11,
      6,
      5
    ]
  },
  {
    "id": 20,
    "name": "Король говорит!",
    "year": 2010,
    "description": "Герцог готовится вступить в должность британского короля Георга VI, отца королевы Елизаветы II. После того, как его брат отрекается от престола, мужчина неохотно соглашается на трон. Измученный страшным нервным заиканием и сомнениями в своих способностях руководить страной, Георг обращается за помощью к неортодоксальному логопеду по имени Лайонел Лог.",
    "genre": [
      1,
      2,
      3
    ]
  },
  {
    "id": 21,
    "name": "Холодное сердце",
    "year": 2013,
    "description": "Когда сбывается древнее предсказание, и королевство погружается в объятия вечной зимы, трое бесстрашных героев - принцесса Анна, отважный Кристофф и его верный олень Свен - отправляются в горы, чтобы найти сестру Анны, Эльзу, которая может снять со страны леденящее заклятие. По пути их ждет множество увлекательных сюрпризов и захватывающих приключений: встреча с мистическими троллями, знакомство с очаровательным снеговиком по имени Олаф, горные вершины покруче Эвереста и магия в каждой снежинке. Анне и Кристоффу предстоит сплотиться и противостоять могучей стихии, чтобы спасти королевство и тех, кто им дорог.",
    "genre": [
      7,
      8,
      4,
      5
    ]
  }
]
